const players = [23, 44, 57, 86, 33, 98, 86, 79]
const selected = players.find(player => player > 70)
console.log(selected)



//তাহলে আমরা এখান থেকে চারটা জিনিস সম্পর্কে জানতে পেরেছি 

/**
 * 1. map  হচ্ছে একটা array প্রত্যেক উপাদানের উপরে যায় এবং যে কাজটা দেওয়া থাকে সেটা প্রত্যেকটা উপাদানের জন্য করে। তারপর রেজাল্টটা একটা array ভিতর রাখে এবং সেই array রিটার্ন করে দেয়।
 * 2. forEach array এর ভিতরে উপাদানের ভিতরে যাবে এবং সেখানে গিয়ে ঘুমায় থাকবে কিন্তু কিছু রিটার্ন দিবে না ।
 * 3. filter শর্ত যারা ফুলফিল করে তাদের সবাইকে দিবে || যদি কেউ না মিলে তাহলে [] দিবে || আর যদি সবগুলো মিলে যায় তাহলে একটা array দিবে 
 * 4. find হচ্ছে কোন array দিবেনা শর্ত ফুলফিল  করে যদিও একাধিক থাকে তাহলে প্রথমটা দিবে তাছাড়া বাদবাকি দিবেনা ||  আর কিচ্ছু না পাইলে undefined দিবে 
 * 5. reduce হচ্ছে সবগুলো উপাদান থেকে নিয়ে নিয়ে আল্টিমেট জিনিস বানাবে
 */ 